{"/group-1/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-1":{"title":"Group 1","data":{"vision-statement#Vision Statement":"Our Voice Output Communication App will be available for individuals with communication needs and speech assistance. We provide a patient-friendly, inclusive, and customizable solution, enabling seamless communication in both English and Spanish. Our goal is to help users express themselves effectively, bridging the gap left by existing iOS-only options.","problem-statement#Problem Statement":"To be completed soon","project-overview#Project Overview":"To be completed soon","members#Members":"Armon Lee\nGagik Papoyan\nIan Valle\nKaijing Zheng\nRobin Rosculete\nSarkis Shil-Gevorkyan\nView the teams page"}},"/group-1/team":{"title":"Team","data":{"team#Team":"Hello, my name is Armon Lee and I'm a senior computer science major at\nCSUN. My goal for my senior software development project is to create an\ninnovative application that addresses real-world problems, showcasing my\ntechnical skills and contributing to my field\nHello, my name is Robin Rosculete. I'm a senior computer science major and a mathematics minor at CSUN. My goal is to build an application that uses Machine Learning to improve people's life.\nHey! I’m Sarkis Shil-Gevorkyan. I am a senior at CSUN studying Computer\nScience. I am hoping to use my experience and skills to solve problems and\nfurther develop and advance Artificial Intelligence\nHi, I'm Gagik Papoyan. I'm a senior at CSUN studying computer science. My\ngoal is to learn and improve problem solving skills to eventually empower\npeople's quality of life in its many aspects.\nHi! My name is Ian Valle and I am a senior studying Computer Science at\nCSUN. I hope to use my skills to fix issues and continuously improve my\nskills as technology advances.\nHello! My name is Kaijing ZhengKaijing Zheng.ç"}},"/group-2/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"To be completed soon","final-presentation#Final Presentation":"To be completed soon","final-project-report#Final Project Report":"To be completed soon","posters#Posters":"To be completed soon","videos#Videos":"To be completed soon"}},"/group-2":{"title":"Group 2","data":{"vision-statement#Vision Statement":"Our vision is to make virtual reality inclusive by enabling everyone to immerse themselves fully\nin the virtual world. We aim to transform the VR experience for users who cannot use one hand\nfor a handheld controller by providing alternate input devices. Unlike standard VR platforms like\nOculus and Playstation VR, our product, the <Foot Arm Controller Thing>™, does not rely\non handheld controllers that assume upper-body movement capability for amputees and individuals\nwith upper-body limitations. The <Foot Arm Controller Thing>™ eliminates these limitations,\nallowing everyone to enjoy an immersive virtual reality experience, regardless of their upper-body\nfunction.","problem-statement#Problem Statement":"To be completed soon","project-overview#Project Overview":"To be completed soon","members#Members":"Anthony Daulo, Artim Trofimenko, Felipe Soto, Narek Karapetyan, Adrian Leon, Gerard GandioncoView the teams page"}},"/group-2/team":{"title":"Team","data":{"team#Team":"Hello! I'm Anthony Daulo. I'm a CS Senior at CSUN who transferred from\nPierce College. I'm hoping to use my experience to help people and make\nnoticeable difference in our users day.\nHey! I'm Artim Trofimenko, I'm a senior at CSUN studying Computer Science.\nI want to solve problems and help improve people's lives by using the\nskills I've learned as a software engineer.\nHi! I’m Felipe Soto, I’m a Senior at CSUN who transferred from Pierce\nCollege. I want transform visions into tangible realities and use my\nskills to help improve the digital landscape and elevate software\nsolutions for users everywhere.\nHello! I am Omar Monge and I am a CS senior at CSUN. I want to create\ntools and create valuable change to people’s life. I am passionate and\ndriven with my mission.\nHello, I am Narek Karapetyan, a senior computer science student at CSUN. I\naspire to leverage my acquired skills to make a meaningful impact on our\nworld\nTBC\nTBC"}},"/group-3/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-3":{"title":"Group 3","data":{"vision-statement#Vision Statement":"","problem-statement#Problem Statement":"","project-overview#Project Overview":"","members#Members":"View the teams page"}},"/group-3/team":{"title":"Team","data":{"team#Team":""}},"/group-4/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-4":{"title":"Group 4","data":{"vision-statement#Vision Statement":"","problem-statement#Problem Statement":"","project-overview#Project Overview":"","members#Members":"View the teams page"}},"/group-4/team":{"title":"Team","data":{"team#Team":""}},"/":{"title":"Index","data":{}}}