{"/group-1/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-1":{"title":"Group 1","data":{"vision-statement#Vision Statement":"Our Voice Output Communication App will be available for individuals with communication needs and speech assistance. We provide a patient-friendly, inclusive, and customizable solution, enabling seamless communication in both English and Spanish. Our goal is to help users express themselves effectively, bridging the gap left by existing iOS-only options.","problem-statement#Problem Statement":"To be completed soon","project-overview#Project Overview":"To be completed soon","members#Members":"Armon Lee\nGagik Papoyan\nIan Valle\nKaijing Zheng\nRobin Rosculete\nSarkis Shil-Gevorkyan\nView the teams page"}},"/group-1/team":{"title":"Team","data":{"team#Team":"Hello, my name is Armon Lee and I'm a senior computer science major at\nCSUN. My goal for my senior software development project is to create an\ninnovative application that addresses real-world problems, showcasing my\ntechnical skills and contributing to my field\nHello, my name is Robin Rosculete. I'm a senior computer science major and a mathematics minor at CSUN. My goal is to build an application that uses Machine Learning to improve people's life.\nHey! I’m Sarkis Shil-Gevorkyan. I am a senior at CSUN studying Computer\nScience. I am hoping to use my experience and skills to solve problems and\nfurther develop and advance Artificial Intelligence\nHi, I'm Gagik Papoyan. I'm a senior at CSUN studying computer science. My\ngoal is to learn and improve problem solving skills to eventually empower\npeople's quality of life in its many aspects.\nHi! My name is Ian Valle and I am a senior studying Computer Science at\nCSUN. I hope to use my skills to fix issues and continuously improve my\nskills as technology advances.\nHi! I'm Kaijing Zheng. I'm a senior computer science student at CSUN. I hope\nto help people solve problems by using the skills I have learned."}},"/group-2/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-2":{"title":"Group 2","data":{"vision-statement#Vision Statement":"Our vision is to make virtual reality inclusive by enabling everyone to immerse themselves fully\nin the virtual world. We aim to transform the VR experience for users who cannot use one hand\nfor a handheld controller by providing alternate input devices. Unlike standard VR platforms like\nOculus and Playstation VR, our product, the Foot Arm Controller Thing™, does not rely\non handheld controllers that assume upper-body movement capability for amputees and individuals\nwith upper-body limitations. The Foot Arm Controller Thing™ eliminates these limitations,\nallowing everyone to enjoy an immersive virtual reality experience, regardless of their upper-body\nfunction.","problem-statement#Problem Statement":"To be determined","project-overview#Project Overview":"To be determined","members#Members":"Anthony Daulo\nArtim Trofimenko\nFelipe Soto\nNarek Karapetyan\nAdrian Leon\nGerard Gandionco\nView the teams page"}},"/group-2/team":{"title":"Team","data":{"team#Team":"Hello! I'm Anthony Daulo. I'm a CS Senior at CSUN who transferred from\nPierce College. I'm hoping to use my experience to help people and make\nnoticeable difference in our users day.\nHey! I'm Artim Trofimenko, I'm a senior at CSUN studying Computer Science.\nI want to solve problems and help improve people's lives by using the\nskills I've learned as a software engineer.\nHi! I’m Felipe Soto, I’m a Senior at CSUN who transferred from Pierce\nCollege. I want transform visions into tangible realities and use my\nskills to help improve the digital landscape and elevate software\nsolutions for users everywhere.\nHello! I am Omar Monge and I am a CS senior at CSUN. I want to create\ntools and create valuable change to people’s life. I am passionate and\ndriven with my mission.\nHello, I am Narek Karapetyan, a senior computer science student at CSUN. I\naspire to leverage my acquired skills to make a meaningful impact on our\nworld\nHello, I'm Adrian, a senior computer science student at CSUN. My drive is\nto apply my skills in crafting impactful tools that assist others in\nreaching their goals.\nHey, I'm Gerard. I'm in my final year at CSUN as a transferee from College\nof the Canyons completing my bachelor's in Computer Science. I have a\npassion for code as an originally self-taught programmer and want to now\ncreate tools that impact people's livelihoods and the world in positive\nways."}},"/group-3/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-3":{"title":"Group 3","data":{"vision-statement#Vision Statement":"Our vision is to contribute to the field of rehabilitation by offering an immersive and enjoyable VR-powered Mirror Therapy program. By doing so, we aim to make this therapy more accessible and effective, ultimately enhancing the overall well-being and rehabilitation outcomes for individuals living with limb loss. Our commitment is to empower bilateral amputees through cutting-edge technology and a user-friendly experience that fosters healing and recovery. By providing an immersive and enjoyable VR-powered Mirror Therapy program, our project seeks to improve the accessibility and effectiveness of this therapy, enhancing the overall well-being and rehabilitation of individuals with limb loss.","problem-statement#Problem Statement":"Many bilateral amputees face limited access to effective and affordable phantom limb therapy. Traditional methods often lack accessibility and engagement. Our challenge is to develop a solution that bridges this gap.","project-overview#Project Overview":"To be determined","members#Members":"Mark Reyes\nJustin Gustowski\nGarrette Clarke\nRmata Muadthong\nJonathan Williams\nView the teams page"}},"/group-3/team":{"title":"Team","data":{"team#Team":"I'm Mark Reyes, and I have a strong passion for coding. I'm looking forward to applying my coding skills to our senior design project and collaborating with the team to create something meaningful.\nHi, I'm Justin Gustowski, and I have a deep appreciation for coding. I'm excited about the coding challenges that lie ahead in our senior design project and am eager to contribute my coding expertise to the team.\nI'm Garrette Clarke, and I find coding to be a fascinating endeavor. I'm looking forward to the coding tasks that will come our way during our senior design project and am ready to roll up my sleeves and get to work.\nI'm Rmata Muadthong, and I have a strong affinity for coding. I'm enthusiastic about the coding aspects of our senior design project and am eager to see how we can bring our ideas to life through code.\nHey, I'm Jonathan Williams, and coding is my forte. I'm genuinely interested in the coding challenges that our senior design project will present, and I'm excited to work with the team to make our project a reality."}},"/group-4/artifacts":{"title":"Artifacts","data":{"artifacts#Artifacts":"","prototype-design#Prototype Design":"","final-presentation#Final Presentation":"","final-project-report#Final Project Report":"","posters#Posters":"","videos#Videos":""}},"/group-4":{"title":"Group 4","data":{"vision-statement#Vision Statement":"The Infinity Arm is designed for transradial amputees who are looking to be fitted for the Infinity-2 “below-the-elbow” prosthetic arm. The Infinity Arm VR Demo is a virtual training that allows amputees to practice/train with the Infinity-2 prosthetic arm before fitting. Unlike other prosthetic arms and their control schemes, our product uses buttons within a foot sole (provided by Dr. Bishay and his team) in order to control finger movements. It also gives the user a cost-effective opportunity to help acquire the necessary skills and experience to use the Infinity-2 before being fitted for the physical prosthetic.","problem-statement#Problem Statement":"To provide a simulation platform for the Infinity-2 prosthetic arm for amputees who may be unsure about the prosthetic arm. This platform will simulate a virtual training environment that allows them to practice using the arm before continuing to use the physical prosthetic.","project-overview#Project Overview":"To be completed soon","members#Members":"Cain Coyco\nYashira Almanza\nMichael Green\nRichard Caldera\nSamuel Lee\nBrian Kaddu\nChristian Walsh\nView the teams page"}},"/group-4/team":{"title":"Team","data":{"team#Team":"","cain-coyco#Cain Coyco":"My name is Cain Coyco, an ongoing Computer Science major; many of my family and friends refer to me as “the light of the party.” This is because I tend to always come into the room with a positive attitude and comedic relief. I am no stranger to public speaking and taking leadership roles in team environments. I have a wide array of skills; from Agile techniques to Java proficiency to communication, I will be able to adapt and overcome any obstacles that come my way while working towards my end goals.","yashira-almanza#Yashira Almanza":"My name is Yashira Almanza, and I am currently majoring in computer science. I have spent four years as an active member of a student organization, honing my leadership and teamwork skills. I aspire to become a data scientist, leveraging my analytical prowess to solve real-world problems. I have background knowledge on ARCGIS, Pg Admin, currently working with SQL, and as for coding languages, I work with Java and Python. When I am not immersed in my studies or pursuing my career goals, I enjoy the simple pleasures of life, often spending quality time watching movies with my beloved family. My determination, combined with her love for both technology and family, defines me as a well-rounded and dedicated individual.","michael-green#Michael Green":"My name is Michael Green, outside of my computer science skills I am also quite creative. My best skills are my ability to multitask and adapt. I have a few different skills and experience including knowledge of programming languages such as Java, C, C++. I also have some but not as much experience with HTML, C#, and some knowledge of computer graphics.","richard-caldera#Richard Caldera":"Hello, I’m Richard Caldera, a computer science student with a fascination for creating digital experiences through both web and game development. I have ranging experience in coding with Java, C, HTML, and Javascript that continues to improve daily. Some of my interests include playing video games, board games, and doing nature related activities. I look forward to continuing to apply my creativity, knowledge, and experience in my future work acquiring new skills and immersing myself further into the field.","samuel-lee#Samuel Lee":"My government name is Samuel but I like to go by Sam. I took an interest in computer science because of my love of video games - that was a mistake. Now I am in my fourth year and it is too late to quit. Throughout my four years, I learned Java, HTML, MIPS assembly language, and now I am starting to learn C. One of my bucket list is to experience what it’s like to develop a game.","brian-kaddu#Brian Kaddu":"My name is Brian Kaddu and I'm generally a carefree and easygoing person but I get serious about things I'm passionate about. In this project I plan to expand and develop my skills as a software developer. As an asipring hobby game developer this project will be a great opportunity to learn 3d and vr game development in a group environment. Learning new skills and engineering software at the same time will be difficult but I believe the challenges can be overcome using teamwork and specialization.","christian-walsh#Christian Walsh":"Hello, I'm Chris. I'm aiming to become a software engineer once I graduate. Outside of school I enjoy building websites and projects, I also enjoy playing video games in my free time. My primary focus and skills currently are on web technologies but I'm eager to learn and adapt to new skillsets with this project."}},"/":{"title":"Index","data":{}}}